documentation/developer-doc/mv-table-developer-documentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Developer documentation</title>
<!-- 2014-05-27 Tue 14:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Mirko Vukovic" />


</head>
<body>
<div id="content">
<h1 class="title">Developer documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Data storage</a></li>
<li><a href="#sec-2">2. CLOS &amp; MOP implementation of tables as classes</a></li>
<li><a href="#sec-3">3. CLOS &amp; MOP implementation methods on tables</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Data storage</h2>
<div class="outline-text-2" id="text-1">
<p>
By default column tables are stored in table class slots - one slot
per vector.  Extensions are allowed to store tables as
</p>
<ul class="org-ul">
<li>sequence of vectors
<ul class="org-ul">
<li>a vector of vectors
</li>
<li>a structure of vectors
</li>
</ul>
</li>
<li>a single vector
</li>
<li>a matrix
</li>
</ul>


<p>
Each of these has impact on table growth and type checking
</p>

<p>
The table storage options, by table type are
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">N</th>
<th scope="col" class="left">VxV</th>
<th scope="col" class="left">SxV</th>
<th scope="col" class="left">V</th>
<th scope="col" class="left">M</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Column table</td>
<td class="left">&checkmark;</td>
<td class="left">&checkmark;</td>
<td class="left">&checkmark;</td>
<td class="left">&checkmark;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Square table</td>
<td class="left">&checkmark;</td>
<td class="left">&checkmark;</td>
<td class="left">&checkmark;</td>
<td class="left">&checkmark;</td>
<td class="left">&checkmark;</td>
</tr>

<tr>
<td class="left">Matrix table</td>
<td class="left">&#xa0;</td>
<td class="left">&checkmark;</td>
<td class="left">&#xa0;</td>
<td class="left">&checkmark;</td>
<td class="left">&checkmark;</td>
</tr>
</tbody>
</table>



<p>
A table can add rows on the storage options (* is for square tables
where all columns have equal length):
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">+ Row</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">N</td>
<td class="left">&checkmark;</td>
</tr>

<tr>
<td class="left">VxV</td>
<td class="left">&checkmark;*</td>
</tr>

<tr>
<td class="left">SxV</td>
<td class="left">&checkmark;*</td>
</tr>

<tr>
<td class="left">V</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">M</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Columns are added by redefining a table, much as a class can be
redefined by recompiling <code>defclass</code>.  All table storage types can
add columns.
</p>

<p>
Column type checking depends on the table type.  Matrix table store
the same data type in all the cells.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Checking?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Column</td>
<td class="left">&checkmark;</td>
</tr>

<tr>
<td class="left">Square</td>
<td class="left">&checkmark;</td>
</tr>

<tr>
<td class="left">Matrix</td>
<td class="left">&times;</td>
</tr>
</tbody>
</table>

<p>
Efficient type works only for V&times;V and S&times;V storage types.
Internally, the vectors are defined to store values of a specified
type, which can lead to storage and access optimization by the CL.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> CLOS &amp; MOP implementation of tables as classes</h2>
<div class="outline-text-2" id="text-2">
<p>
mv-tables are defined in terms of several metaobject (MO) classes
and at least one standard class mixin.
</p>

<p>
Table organization, storage and operations are specified using three
families of MO classes:
</p>
<ul class="org-ul">
<li>type virtual MO class and its specialized MO classes
<ul class="org-ul">
<li>column
<ul class="org-ul">
<li>square.  This type is a sub-type of the column table type
</li>
</ul>
</li>
<li>matrix
</li>
</ul>
</li>
<li>storage virtual MO class and its specialized MO classes
<ul class="org-ul">
<li>columns
</li>
<li>matrix
</li>
<li>vector
</li>
<li>file
</li>
<li>external
<ul class="org-ul">
<li>various db-access MO classes
</li>
</ul>
</li>
</ul>
</li>
<li>access virtual MO class and its specialized MO classes
<ul class="org-ul">
<li>sequential
</li>
<li>random
</li>
</ul>
</li>
</ul>


<p>
Not all MO class combinations are defined in the code.  Instead,
they are programatically generated, as discussed in discussed in
[MOP, Sect 2.4].
</p>

<p>
When a mv-table is instantiated, it's metaclass is from one of the
three organization metaclasses families.  The exact one is specified
by the storage and access mix-in metaclasses.
</p>


<p>
Table meta-data (author, source, min, max row counts, allowed
operations, etc), are implemented via the table-md standard class or
classes specialized on it.  This class is a mix-in to the mv-table
class.
</p>

<p>
When the table is instantiated in column mode it has slots storing
columns and more slots storing the table meta-data.  The column
slots are identified as the class direct slots, while the meta-data
slots are identified as inherited slots.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> CLOS &amp; MOP implementation methods on tables</h2>
<div class="outline-text-2" id="text-3">
<p>
All methods are defined as generic functions on the virtual MO
classes.  Individual specializations define the methods, when they
are applicable.
</p>

<p>
Thus, for example, (setf (row-index row) new-index) method will have
a <code>:before</code> method for sequential file-based table that will check
that new-index &ge; current-index, or else issue an error.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mirko Vukovic</p>
<p class="date">Created: 2014-05-27 Tue 14:10</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
